"""
    给你一个 32 位的有符号整数 x ，返回将 x 中的数字部分反转后的结果。

    如果反转后整数超过 32 位的有符号整数的范围 [−231,  231 − 1] ，就返回 0。

    假设环境不允许存储 64 位整数（有符号或无符号）。


    示例 1：

    输入：x = 123
    输出：321
    示例 2：

    输入：x = -123
    输出：-321
    示例 3：

    输入：x = 120
    输出：21
    示例 4：

    输入：x = 0
    输出：0
"""
class Solution:
    def reverse(self, x: int) -> int:
        INT_MIN, INT_MAX = -2 ** 31, 2 ** 31 - 1
        rev = 0

        while x != 0:

            # python-2147483648 // 10 = -214748365（向下取整）所以需要+1(变成-214748364)修正
            if rev < INT_MIN // 10 + 1 or rev > INT_MAX // 10:
                return 0

            """
                a = b * q + r
                a为被除数，b为除数，q为商，r为余数
                python3取模运算中，无论被除数的正负，余数都在[0, 除数)范围内，即商向下取整
                （这里的除数可以为负，余数始终与除数同号）
                例：print(7 % 3)    # 余数范围[0, 1, 2]
                    print(-7 % 3)   # 余数范围[0, 1, 2]
                    print(7 % -3)   # 余数范围[0, -1, -2]
                    print(-7 % -3)   # 余数范围[0, -1, -2]
                所以判断当被除数和除数正负号不同时需要：digit = digit - 除数
                例：digit = -123 % 10   # 7
                    digit = 7 - 10      # -3
            """
            digit = x % 10
            if x < 0 and digit > 0:
                digit -= 10

            x = (x - digit) // 10
            rev = rev * 10 + digit

        return rev